Revit 2026 API

# GenericImportOptionsRefPoint Property

---

Reference point (in Revit) to which the image is going to be inserted.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ RefPoint { get; set; }
```
```vb
Public Property RefPoint As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ RefPoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member RefPoint : XYZ with get, set
```

#### Property Value

XYZ

If , the image will be inserted to the Revit's origin.

#### Reference

GenericImportOptions Class

Autodesk.Revit.DB Namespace